docs/book-notes/EOPL/PROC/PROC.org
#+html_head: <link rel="stylesheet" href="../../../css/org-page.css"/>
#+property: tangle PROC.jo
#+title: PROC

* intro

  - So far our language has only the operations
    that were included in the original language.
    For our interpreted language to be at all useful,
    we must allow new procedures to be created.
    We call the new language PROC.

* exp

  #+begin_src jojo
  (note program = exp)
  (note exp
    = <const-exp>
    | <zero?-exp>
    | <if-exp>
    | <diff-exp>
    | <var-exp>
    | <let-exp>
    | <proc-exp>
    | <call-exp>)

  (+data <const-exp> .num)
  (+data <zero?-exp> .exp1)
  (+data <if-exp>    .exp1 .exp2 .exp3)
  (+data <diff-exp>  .exp1 .exp2)
  (+data <var-exp>   .var)
  (+data <let-exp>   .var .exp1 .body)

  (+data <proc-exp>  .var .body)
  (+data <call-exp>  .rator .rand)
  #+end_src

* expval

  #+begin_src jojo
  (note expval
    = <num-val>
    | <bool-val>
    | <proc-val>)

  (+data <num-val>  .num)
  (+data <bool-val> .bool)

  (+data <proc-val> .proc)
  #+end_src

* proc

  #+begin_src jojo
  (+data <proc> .var .body .saved-env)

  (+jojo proc-apply (-> :val :proc -- expval)
    :proc .saved-env :proc .var :val cons-env
    :proc .body swap eval)
  #+end_src

* specifying proc-exp

  #+begin_src jojo
  (note
    (= :var :body proc-exp :env eval,
       :var :body :env proc proc-val))
  #+end_src

* specifying call-exp

  #+begin_src jojo
  (note
    (= :rator :rand call-exp :env eval,
       :rator :env eval .proc :proc!
       :rand  :env eval :arg!
       :arg :proc proc-apply))
  #+end_src

* environments

  #+begin_src jojo
  (note env = <null-env> | <cons-env>)

  (+data <null-env>)
  (+data <cons-env> .rest .var .val)

  (+jojo env-apply (-> :var :env -- expval)
    (case :env
      <null-env> ["- env-apply fail" p nl
                  "  can not find var : " p :var p nl
                  error]
      <cons-env> (if [:env .var :var equal?]
                     [:env .val]
                     [:var :env .rest env-apply])))
  #+end_src

* program

  #+begin_src jojo
  (+jojo init-env
    null-env
    ':x 10 num-val cons-env
    ':v 5  num-val cons-env
    ':i 1  num-val cons-env)

  (+jojo program-eval (-> :program -- expval)
    :program init-env eval)
  #+end_src

