docs/book-notes/EOPL/PROC/PROC.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-15 Sun 21:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PROC</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="xieyuheng" />
<link rel="stylesheet" href="../../../css/org-page.css"/>
</head>
<body>
<div id="content">
<h1 class="title">PROC</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org575b7d1">intro</a></li>
<li><a href="#org5eb82f8">exp</a></li>
<li><a href="#org8233d7e">expval</a></li>
<li><a href="#orgc4a82c1">proc</a></li>
<li><a href="#orgca74e49">specifying proc-exp</a></li>
<li><a href="#orgc32b793">specifying call-exp</a></li>
<li><a href="#org71c0cfd">environments</a></li>
<li><a href="#org69ed37b">program</a></li>
<li><a href="#org14e6672">eval</a></li>
<li><a href="#orged0da87">parse</a></li>
<li><a href="#org3ac6873">interface</a></li>
<li><a href="#org47257dd"><span class="done _test_">[test]</span> </a></li>
<li><a href="#orge550945">exercise</a></li>
</ul>
</div>
</div>

<div id="outline-container-org575b7d1" class="outline-2">
<h2 id="org575b7d1">intro</h2>
<div class="outline-text-2" id="text-org575b7d1">
<ul class="org-ul">
<li><p>So far our language has only the operations</p><p>that were included in the original language.</p><p>For our interpreted language to be at all useful,</p><p>we must allow new procedures to be created.</p><p>We call the new language PROC.</p></li></ul>
</div>
</div>

<div id="outline-container-org5eb82f8" class="outline-2">
<h2 id="org5eb82f8">exp</h2>
<div class="outline-text-2" id="text-org5eb82f8">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> program = exp<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> exp
  = <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;var-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;proc-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;call-exp&gt;</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span> .num<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span> .exp1<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>    <span style="color: #ae81ff;">.exp1</span> <span style="color: #ae81ff;">.exp2</span> .exp3<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>  <span style="color: #ae81ff;">.exp1</span> .exp2<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;var-exp&gt;</span>   .var<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp&gt;</span>   <span style="color: #ae81ff;">.var</span> <span style="color: #ae81ff;">.exp1</span> .body<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;proc-exp&gt;</span>  <span style="color: #ae81ff;">.var</span> .body<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;call-exp&gt;</span>  <span style="color: #ae81ff;">.rator</span> <span style="color: #ae81ff;">.rand</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8233d7e" class="outline-2">
<h2 id="org8233d7e">expval</h2>
<div class="outline-text-2" id="text-org8233d7e">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> expval
  = <span style="color: #66d9ef; font-weight: bold;">&lt;num-val&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;bool-val&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;proc-val&gt;</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;num-val&gt;</span>  .num<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;bool-val&gt;</span> .bool<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;proc-val&gt;</span> <span style="color: #ae81ff;">.proc</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc4a82c1" class="outline-2">
<h2 id="orgc4a82c1">proc</h2>
<div class="outline-text-2" id="text-orgc4a82c1">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;proc&gt;</span> <span style="color: #ae81ff;">.var</span> <span style="color: #ae81ff;">.body</span> .saved-env<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> proc-apply <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:val</span> <span style="color: #a6e22e;">:proc</span> <span style="color: #66d9ef; font-weight: bold;">--</span> expval<span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:proc</span> <span style="color: #ae81ff;">.saved-env</span> <span style="color: #a6e22e;">:proc</span> <span style="color: #ae81ff;">.var</span> <span style="color: #a6e22e;">:val</span> cons-env
  <span style="color: #a6e22e;">:proc</span> <span style="color: #ae81ff;">.body</span> swap eval<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgca74e49" class="outline-2">
<h2 id="orgca74e49">specifying proc-exp</h2>
<div class="outline-text-2" id="text-orgca74e49">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:body</span> proc-exp <span style="color: #a6e22e;">:env</span> eval<span style="color: #f92672; font-weight: bold;">,</span>
     <span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:body</span> <span style="color: #a6e22e;">:env</span> proc proc-val<span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc32b793" class="outline-2">
<h2 id="orgc32b793">specifying call-exp</h2>
<div class="outline-text-2" id="text-orgc32b793">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:rator</span> <span style="color: #a6e22e;">:rand</span> call-exp <span style="color: #a6e22e;">:env</span> eval<span style="color: #f92672; font-weight: bold;">,</span>
     <span style="color: #a6e22e;">:rator</span> <span style="color: #a6e22e;">:env</span> eval <span style="color: #ae81ff;">.proc</span> <span style="color: #fd971f;">:proc!</span>
     <span style="color: #a6e22e;">:rand</span>  <span style="color: #a6e22e;">:env</span> eval <span style="color: #fd971f;">:arg!</span>
     <span style="color: #a6e22e;">:arg</span> <span style="color: #a6e22e;">:proc</span> proc-apply<span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org71c0cfd" class="outline-2">
<h2 id="org71c0cfd">environments</h2>
<div class="outline-text-2" id="text-org71c0cfd">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> env = <span style="color: #66d9ef; font-weight: bold;">&lt;null-env&gt;</span> | <span style="color: #66d9ef; font-weight: bold;">&lt;cons-env&gt;</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;null-env&gt;</span><span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;cons-env&gt;</span> <span style="color: #ae81ff;">.rest</span> <span style="color: #ae81ff;">.var</span> .val<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> env-apply <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:env</span> <span style="color: #66d9ef; font-weight: bold;">--</span> expval<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:env</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;null-env&gt;</span> <span style="color: #797979;">[</span><span style="color: #e6db74;">"- env-apply fail"</span> p nl
                <span style="color: #e6db74;">"  can not find var : "</span> p <span style="color: #a6e22e;">:var</span> p nl
                <span style="color: #f92672; font-weight: bold;">error</span><span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;cons-env&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:env</span> <span style="color: #ae81ff;">.var</span> <span style="color: #a6e22e;">:var</span> equal?<span style="color: #797979;">]</span>
                   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:env</span> <span style="color: #ae81ff;">.val</span><span style="color: #797979;">]</span>
                   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:env</span> <span style="color: #ae81ff;">.rest</span> env-apply<span style="color: #797979;">]</span><span style="color: #696969;">)))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org69ed37b" class="outline-2">
<h2 id="org69ed37b">program</h2>
<div class="outline-text-2" id="text-org69ed37b">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> init-env
  null-env
  '<span style="color: #a6e22e;">:x</span> <span style="color: #ae81ff;">10</span> num-val cons-env
  '<span style="color: #a6e22e;">:v</span> <span style="color: #ae81ff;">5</span>  num-val cons-env
  '<span style="color: #a6e22e;">:i</span> <span style="color: #ae81ff;">1</span>  num-val cons-env<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> program-eval <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:program</span> <span style="color: #66d9ef; font-weight: bold;">--</span> expval<span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:program</span> init-env eval<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
